{"items": [
  {
    "Week": "Week 1",
    "Did": "Picked name, started project site, discusses requirements to gather, prepared for kickoff, discussed tracking methods, met coach, researched eth & blockchains",
    "Plan": "Hold kickoff, gather reqs, determine deliverables, plan meetings, determine communication method, move site to team account, publish tracking on site, determine version control",
    "Risk": "No communication w/ sponsors yet, new domain, environment setup, mismatched schedules",
    "Need": ""
  },
  {
    "Week": "Week 2",
    "Did": "Met sponsor, sent request for website, determined version control, began researching domain",
    "Plan": "Read Bitcoin & Ethereum papers, Start learning Quorum,Solidity, Read Colin's ERC 20 code (found in Team Drive) and test token on Metamask, Research the Vechain Tokenswap (from VEN (ERC 20) -> VET), Get on the Virtual Machine once Kurt gets it done, project synopsis, project info survey",
    "Risk": "Unknown tech, undefined scope due to new topic (research), no communication, VM time/website",
    "Need": ""
  },
  {
    "Week": "Week 3",
    "Did": "Started Getting everything configure for inital development. This includes: Getting a Windows XM, installing Quorum.",
    "Plan": "Plan to creating Project Plan, inital Domain Model, setting up VM.",
    "Risk": "Delaying the start of research and development by not having a VM set up",
    "Need": "Windows VM from Kurt to start working on ERC20 implementation"
  },
  {
    "Week": "Week 4",
    "Did": "Met with sponsors, decided to use spiral process model, worked on the domain model, worked on the project plan",
    "Plan": "Set up ERC20 and ERC 721 protocol on VM",
    "Risk": "Delaying the start of research and development by not having a VM set up",
    "Need": "Get the VM to set up Quorum."
  },
  {
    "Week": "Week 5",
    "Did": "Creating ERC-20 (Colin) and compled it, started developing ERC-721.",
    "Plan": "Establishing both tokens and Quorum running on the VM",
    "Risk": "VM setup and setting up Quorum on the VM, setting up the tokens since it's new technology. ERC-20 proving to be harder to understand than ERC-20. Will be devoting more resources for it to be completed on time",
    "Need": "VM still"
  },
  {
    "Week": "Week 6",
    "Did": "Fixed all compilier warnings for ERC-20. Finished first edition ERC-721, have one compiler error that still needs to be resolved",
    "Plan": "Plan to add functionality to smart contracts to allow for the bridge transactions",
    "Risk": "How the smart contracts will be designed",
    "Need": ""
  },
  {
    "Week": "Week 7",
    "Did": "Setup of VM to run Quorum with our tokens, reached out to sponsors for alternate VM solution",
    "Plan": "Continue setup of chains and work on tokens",
    "Risk": "VM may have more errors before running chains",
    "Need": "Either the SE VM requires Virtualization setting changed on the Bios, or a VM from sponsors"
  },
  {
    "Week": "Week 8",
    "Did": "More setup of Quorum and establish the Nodes, planning out beta implementation of the contracts",
    "Plan": "Upload the smart contracts on the Quorum instance, begin the bridge development",
    "Risk": "Web vulnerabilities if we decide to go with Web portal for the bridge",
    "Need": ""
  }
]
}
